---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyUncut
source: html/38c910f9-efc1-996b-0f0e-dadb3f67c382.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependencyUncut Property

There is a circular chain of references among the highlighted elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependencyUncut { get; }
```